```digitalocean_firewall.main: Refreshing state... [id=83dc9b06-d529-4fba-9b20-9c425fd474cd]
data.aws_ami.debian_arm64: Reading...
data.aws_ami.debian_x86: Reading...
aws_s3_bucket.tf-management-trail: Refreshing state... [id=tf-management-trail]
aws_dynamodb_table.tf-state-lock: Refreshing state... [id=tf-state-lock]
aws_kms_key.encryption_key: Refreshing state... [id=ccd23c99-9272-49bb-a20e-04b223695683]
aws_s3_bucket.tf-backend: Refreshing state... [id=tf-backend-abhishek]
aws_security_group.main: Refreshing state... [id=sg-06aba332b2d3d09ea]
aws_iam_role.dev_instance_role: Refreshing state... [id=dev_instance_role]
data.aws_ami.debian_arm64: Read complete after 1s [id=ami-07271e17fea6ec431]
data.aws_ami.debian_x86: Read complete after 1s [id=ami-02c084bff28b29ca4]
aws_iam_role_policy_attachment.s3_policy_attachment: Refreshing state... [id=dev_instance_role-20210925181828891000000001]
aws_iam_role_policy_attachment.secrets_manager_policy_attachment: Refreshing state... [id=dev_instance_role-20210925181828900900000002]
aws_iam_instance_profile.dev_instance_profile: Refreshing state... [id=test_profile]
aws_s3_bucket_public_access_block.tf-backend-public-access-block: Refreshing state... [id=tf-backend-abhishek]
aws_s3_bucket_policy.tf-backend-policy: Refreshing state... [id=tf-backend-abhishek]
aws_s3_bucket_policy.tf-management-trail-policy: Refreshing state... [id=tf-management-trail]
aws_s3_bucket_logging.tf-backend-logging: Refreshing state... [id=tf-management-trail]
aws_cloudtrail.management[0]: Refreshing state... [id=tf-trail-management]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_instance_profile.dev_instance_profile must be replaced
-/+ resource "aws_iam_instance_profile" "dev_instance_profile" {
      ~ arn         = "arn:aws:iam::408911611184:instance-profile/test_profile" -> (known after apply)
      ~ create_date = "2021-09-25T18:18:28Z" -> (known after apply)
      ~ id          = "test_profile" -> (known after apply)
      ~ name        = "test_profile" -> "instance_profile" # forces replacement
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
      ~ unique_id   = "AIPAV6NIIAUYKBEQVD4NJ" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_instance.dev[0] will be created
  + resource "aws_instance" "dev" {
      + ami                                  = "ami-02c084bff28b29ca4"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "instance_profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "main"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "x86_dev"
          + "arch" = "amd64"
        }
      + tags_all                             = {
          + "Name" = "x86_dev"
          + "arch" = "amd64"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "c3b34911dcb6da3100100d06acb8fb4e8d178c17"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-06aba332b2d3d09ea",
        ]

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "/dev/sda1"
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 32
          + volume_type           = (known after apply)
        }
    }

  # aws_s3_bucket.tf-management-trail will be updated in-place
  ~ resource "aws_s3_bucket" "tf-management-trail" {
        id                          = "tf-management-trail"
        tags                        = {}
        # (11 unchanged attributes hidden)

      - logging {
          - target_bucket = "tf-backend-abhishek" -> null
          - target_prefix = "log/" -> null
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: CURRENTPLAN.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "CURRENTPLAN.tfplan"
Releasing state lock. This may take a few moments...
```